# taps
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "supabase/tap"
tap "saulpw/vd"

# language toolchains (minimal)
cask "flutter" # my favourite gui framework (comes with dart)
brew "volta" # nodejs manager
brew "typescript-language-server"
brew "vscode-langservers-extracted"
# npm install -g emmet-ls
# npm install -g @astrojs/language-server
brew "python@3.10"
brew "basedpyright"
brew "r"
brew "rustup"
brew "rust-analyzer"
brew "cocoapods" # swift pkg manager
brew "carthage" # another swift pkg manager
brew "shellcheck"

# language toolchains (extended)
mas "Xcode", id: 497799835
#brew "trunk" # WASM bundler for rust
brew "cargo-cache" # cli for safely clearing out .cargo
brew "go"
brew "gopls"
brew "openjdk"
# cask "temurin@8"
brew "jdtls"
#brew "maven"
brew "racket" # i took one cs course that needed this, might remove later
brew "cmake"
brew "arduino-cli"
brew "qt"
brew "ruby"
brew "gcc"
brew "wxmaxima" # for my biomathematics course
cask "rstudio" # for stats course, will remove later
brew "meson" # i'm actually not entirely sure why i have this on hand, but it
             # seems useful so i'm gonna keep it for now

# document toolchains
brew "pandoc"
brew "pandoc-crossref"
cask "quarto"
cask "mactex"
brew "texlab"
brew "mdbook"
brew "zola"

# dbs
brew "mysql"
brew "postgresql@16" # is this outdated?

# dev setup (minimal)
brew "vim" # world's best text editor (let the flame wars begin!)
cask "iterm2"
brew "fzf"
brew "gum"
brew "ripgrep"
brew "coreutils"

# science
cask "miniconda"

# dev setup (extended)
brew "neovim" # occasionally i want to use treesitter
cask "visual-studio-code" # «IDE»
brew "docker"
brew "gh"
brew "saulpw/vd/visidata" # TUI for viewing CSV/SQLite/xlsx/etc
#cask "db-browser-for-sqlite" # unused bc i use visidata now
cask "ngrok"
brew "scc" # analyze no. of lines of code
# https://github.com/thesephist/superstat
mas "TestFlight", id: 899247664
#cask "postico" # native macOS postgres browser, i use visidata now
cask "utm"
brew "wireshark"
brew "qemu"
brew "supabase/tap/supabase"
brew "cloudflare-wrangler2"
cask "sf-symbols"
brew "cargo-binstall" # for dioxus cli for igem
#brew "neovide" # neat neovim gui, but why gui if vim
#cask "sublime-merge" # great git client, but macOS has opendiff

# git tools
brew "bfg" # cleanse data from a repo
brew "git-filter-repo" # rewrite git history
brew "git-lfs"
brew "git-gui" # ugliest git gui in existence

# cli tools
brew "z"
brew "hledger" # make sure i don't accidentally go broke
brew "yt-dlp"
brew "ocrmypdf" # god looked at the PDF and said, LET THERE BE SELECTABLE TEXT
brew "glow" # aesthetic markdown reader CLI
brew "tree" # nice listing of directory structure
brew "bat" # aesthetic version of cat
# brew "fd" # user-friendly find, unused bc i want to use more standard version
# curl https://raw.githubusercontent.com/thameera/vimv/master/vimv > ~/.local/bin/vimv && chmod +x ~/.local/bin/vimv
brew "ffmpeg"
brew "openconnect" # use this for ubc vpn to connect to hpc cluster when off-campus
brew "slides" # show slides from markdown on the cli
brew "imagemagick"
brew "bitwarden-cli"
brew "choose-gui" # really cool GUI fuzzy picker - chooses from stdin
brew "transmission-cli" # for torrenting
brew "cowsay" # haha funny cow speech bubble output
brew "lolcat" # haha funny neon coloured output
brew "cmus" # TUI music player
brew "mpv"
brew "htop"
brew "graphviz"
brew "gnuplot"
brew "gs" # for compressing PDFs
#brew "koekeishiya/formulae/yabai" # twm for macOS, i don't use this anymore
brew "khanhas/tap/spicetify-cli"
brew "mas" # install mac app store apps from the CLI
#brew "ical-buddy" # idk why i had this installed but it seems pretty cool
#brew "tmux" # can't be bothered to learn how this works
#brew "defaultbrowser" # now that i don't browser-hop this isn't as necessary
brew "gifski"
brew "ranger"
#brew "neofetch" # FOR THE AESTHETICS 😤
brew "speedtest-cli"
brew "asciinema" # better terminal recording
brew "links"
brew "fswatch"

# cli games - i don't really use these but they're cool ig
#brew "gnu-chess"
#brew "pacman4console"
#brew "ninvaders"

# keyboard & peripheral related
brew "koekeishiya/formulae/skhd" # global keybinds
cask "espanso" # text expansion
cask "karabiner-elements" # low-level keyboard remaps
cask "keyboardcleantool" # lock keyboard keys
cask "logi-options+" # configure all the funky little buttons on mx master -
                     # this is a horrible piece of software and should die in a
                     # fire

# the usual
cask "firefox@developer-edition"
cask "spotify"
#cask "sioyek" # PDF reader, amusingly low feature overlap w mainstream readers
# currently using alpha build of sioyek:
# https://github.com/ahrm/sioyek/releases/tag/sioyek3-alpha0
cask "zotero"
mas "OneDrive", id: 823766827 # cannot believe i'm still paying for this tbh
cask "iina" # native GUI wrapper around mpv
cask "raycast" # best launcher on macOS (let the flame wars begin!)
cask "bitwarden" # it ain't great, but it's FOSS, and it works
mas "Microsoft Excel", id: 462058435 # i prefer jupyter notebooks tbh
mas "Microsoft Word", id: 462054704 # unfortunately, other ppl don't use .md
mas "Drafts", id: 1435957248 # store snippets of text between iOS/macOS
cask "calibre"
cask "chromium" # for webdev testing on chromium
cask "dropbox" # i use this to sync books to my kobo
#cask "mochi" # flashcards - don't really need this nowadays

# creative
cask "affinity-designer"
cask "affinity-photo"
cask "figma"
cask "blender"
mas "DaVinci Resolve", id: 571213070
mas "Pastel", id: 413897608 # save color palettes (+ why native != better)
cask "gifcapture"
cask "musescore"
cask "sim-daltonism"
#cask "canva" # terribly nerfed design software
#cask "obs" # built-in screen record is good enough mostly
#cask "shotcut" # i use resolve now
#cask "scrivener" # never actually bought this, now i just use vim
#mas "Muse", id: 1501563902 # i keep this around to study the product design

# fonts
cask "font-dm-mono"
cask "font-inconsolata-nerd-font"
cask "font-iosevka"
cask "font-bad-script"
cask "font-xkcd"
cask "font-inter"
cask "font-funnel-display"
cask "font-schibsted-grotesk"

# communication
cask "signal"
cask "zoom"
cask "discord"
cask "slack"
cask "microsoft-outlook" # for igem email

# games
cask "steam"
cask "endless-sky"
cask "the-battle-for-wesnoth"
cask "tetrio"

# handy little utilities
cask "flux-app" # ensure my eyes remain intact
cask "imageoptim" # legendary image compression
cask "pika" # really nice colour picker with contrast report
mas "Hyperduck", id: 6444667067 # share links to my mac from iOS
cask "dozer"
#mas "PDF Viewer", id: 1120099014 # i only use this to insert imgs into PDFS
#cask "pdfsam-basic" # replaced with scripts
#cask "rectangle" # window management by a great indie dev - now using raycast
cask "transmission" # torrent
cask "the-unarchiver" # can't remember what compression format i use this for
#mas "Microsoft Remote Desktop", id: 1295203466 # remote into windows machines
cask "hazeover" # dim everything except focused window
cask "syntax-highlight" # syntax highlighting in quicklook
mas "KeyLimePie", id: 1575163350 # show what keybinds you press on screen
cask "adobe-digital-editions" # get un-DRMed ebooks
cask "prince" # html->pdf

# stuff i keep to open up old files
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
#mas "Microsoft PowerPoint", id: 462062816 # haven't needed it in ages
#mas "Goodnotes", id: 1444383602 # i no longer support digital handwriting

# vscode extensions
vscode "mvllow.rose-pine" # theme of choice
vscode "cdonohue.quill-icons" # i like these icons
vscode "vscodevim.vim" # cannot use vscode without this
vscode "tomoki1207.pdf" # render PDFs in vscode
vscode "dhedgecock.radical-vscode" # i use ths if i use dark mode
vscode "alexandernanberg.horizon-theme-vscode" # this is cute too ig
vscode "eamodio.gitlens" # show git blame directly in editor
vscode "icrawl.discord-vscode" # discord rpc
#vscode hoovercj.vscode-power-mode # funny flame effects when you type
#vscode "foam.foam-vscode" # like obsidian, but in vscode - unused
vscode "ms-vsliveshare.vsliveshare" # look at what google docs needs to imitate
                                    # a mere fraction of our power

# vscode language support
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "quarto.quarto"
#vscode "James-Yu.latex-workshop" # i use vimtex nowadays
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.isort"
vscode "rust-lang.rust-analyzer"
vscode "golang.go"
vscode "ms-vscode.cpptools"
#vscode "dunstontc.viml" # why did i have vimscript support in vscode

# vscode markdown tooling
vscode "yzhang.markdown-all-in-one"
vscode "tchayen.markdown-links" # show obsidian-like graph of wikilinks
vscode "bierner.markdown-mermaid" # render mermaid diagrams
vscode "bierner.markdown-footnotes"
vscode "kortina.vscode-markdown-notes" # enable wikilinks
vscode "gera2ld.markmap-vscode" # render a bullet list as a mindmap
vscode "jloow.vscode-criticmarkup"
vscode "ban.spellright"
