tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "michaeleisel/zld"
tap "supabase/tap"
brew "libpng"
brew "gettext"
brew "glib"
brew "pkg-config"
brew "pixman"
brew "python@3.9"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "arduino-cli"
brew "python@3.10"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "bat"
brew "openjdk"
brew "bfg"
brew "node"
brew "bitwarden-cli"
brew "boost"
brew "carthage"
brew "ccache"
brew "choose-gui"
brew "cmake"
brew "libidn2"
brew "gnutls"
brew "tesseract"
brew "ffmpeg"
brew "cmus"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "cowsay"
brew "defaultbrowser"
brew "docker", link: false
brew "docutils"
brew "exa"
brew "fd"
brew "ffmpeg@4"
brew "fzf"
brew "gcc"
brew "gd"
brew "gh"
brew "ghostscript"
brew "gifski"
brew "tcl-tk"
brew "git-gui"
brew "git-lfs"
brew "glow"
brew "gnu-chess"
brew "gnu-sed"
brew "lua"
brew "qt"
brew "gnuplot"
brew "go"
brew "gobject-introspection"
brew "netpbm"
brew "gts"
brew "libtool"
brew "graphviz"
brew "gtk+3"
brew "guile"
brew "hledger"
brew "htop"
brew "ical-buddy"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "inetutils"
brew "jbig2enc"
brew "jemalloc"
brew "jsonschema"
brew "libfido2"
brew "libproxy"
brew "libqalculate"
brew "libraqm"
brew "libssh"
brew "links"
brew "llvm"
brew "lolcat"
brew "luv"
brew "mas"
brew "maven"
brew "mdbook"
brew "ninja"
brew "meson"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "msgpack"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "neovide"
brew "nghttp2"
brew "ninvaders"
brew "nvm"
brew "pillow"
brew "qpdf"
brew "unpaper"
brew "ocrmypdf"
brew "openblas"
brew "pacman4console"
brew "pandoc"
brew "pandoc-crossref"
brew "virtualenv"
brew "poetry"
brew "poppler"
brew "postgresql@14"
brew "qt@5"
brew "pyqt@5"
brew "python-tk@3.9"
brew "qemu"
brew "r"
brew "ragel"
brew "ranger"
brew "ripgrep"
brew "rust-analyzer"
brew "scc"
brew "scons"
brew "socat"
brew "speedtest-cli"
brew "sphinx-doc"
brew "texlab"
brew "thefuck"
brew "tmux"
brew "transmission-cli"
brew "trunk"
brew "wifi-password"
brew "wireshark"
brew "youtube-dl"
brew "z"
brew "khanhas/tap/spicetify-cli"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "michaeleisel/zld/zld"
brew "supabase/tap/supabase"
cask "adobe-digital-editions"
cask "adoptopenjdk8"
cask "affinity-designer"
cask "blender"
cask "bluestacks"
cask "calibre"
cask "canva"
cask "chromium"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker"
cask "dozer"
cask "dropbox"
cask "espanso"
cask "figma"
cask "firefox-developer-edition"
cask "flutter"
cask "flux"
cask "font-inconsolata-nerd-font"
cask "font-iosevka"
cask "gifcapture"
cask "hazeover"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "logi-options-plus"
cask "mactex"
cask "mochi"
cask "mono-mdk-for-visual-studio"
cask "musescore"
cask "ngrok"
cask "obs"
cask "pdfsam-basic"
cask "pennywise"
cask "phantomjs"
cask "pika"
cask "postico"
cask "prince"
cask "quarto"
cask "racket"
cask "raycast"
cask "scrivener"
cask "shotcut"
cask "signal"
cask "sioyek"
cask "skim"
cask "slack"
cask "spotify"
cask "steam"
cask "sublime-merge"
cask "tetrio"
cask "the-battle-for-wesnoth"
cask "the-unarchiver"
cask "thonny"
cask "tor-browser"
cask "transmission"
cask "utm"
cask "vimr"
cask "visual-studio-code"
cask "wkhtmltopdf"
cask "zoom"
cask "zotero"
mas "Bitwarden", id: 1352778147
mas "DaVinci Resolve", id: 571213070
mas "Drafts", id: 1435957248
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "KeyLimePie", id: 1575163350
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Muse", id: 1501563902
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Pastel", id: 413897608
mas "PDF Viewer", id: 1120099014
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
vscode "alexandernanberg.horizon-theme-vscode"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "ban.spellright"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "cdonohue.quill-icons"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dhedgecock.radical-vscode"
vscode "dunstontc.viml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "gera2ld.markmap-vscode"
vscode "golang.go"
vscode "icrawl.discord-vscode"
vscode "James-Yu.latex-workshop"
vscode "jloow.vscode-criticmarkup"
vscode "kortina.vscode-markdown-notes"
vscode "mel-brown.deep-purple"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "quarto.quarto"
vscode "rust-lang.rust-analyzer"
vscode "svelte.svelte-vscode"
vscode "tchayen.markdown-links"
vscode "tomoki1207.pdf"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
